#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mysticx/test-api-driven-workflow/runs/run-JanxhKVco2UT9hbH

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "MockInfra-default_SG"
        }
      + tags_all               = {
          + "Name" = "MockInfra-default_SG"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-eip"
        }
      + tags_all             = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-eip"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-igw"
        }
      + tags_all = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-ngw"
        }
      + tags_all             = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-ngw"
        }
    }

  # module.vpc.aws_route.private_nat_gateway will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_route_table.private_rt will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-private-route-table"
        }
      + tags_all         = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-private-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-public-route-table"
        }
      + tags_all         = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-public-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1a-private-subnet"
        }
      + tags_all                                       = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1a-private-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1b-private-subnet"
        }
      + tags_all                                       = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1b-private-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1a-public-subnet"
        }
      + tags_all                                       = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1a-public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.150.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1b-public-subnet"
        }
      + tags_all                                       = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-us-east-1b-public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.150.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-vpc"
        }
      + tags_all                             = {
          + "Author"     = "asterna"
          + "Date"       = "17/11/22"
          + "DeployedBy" = "Terraform"
          + "Name"       = "MockInfra-vpc"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @Mysticx69, Action: `pull_request`*